updated readme of v1, v2 and changed the name of the folder in v3 form photos to images
